In [52]:
import pandas as pd

df = pd.read_csv("C:/Users/a/Downloads/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [54]:
df.drop(['PassengerId','Name','Cabin','Ticket'], axis=1, inplace = True)

In [55]:
df[df['Age'].isna()]

     Survived  Pclass     Sex  Age  SibSp  Parch     Fare Embarked
5           0       3    male  NaN      0      0   8.4583        Q
17          1       2    male  NaN      0      0  13.0000        S
19          1       3  female  NaN      0      0   7.2250        C
26          0       3    male  NaN      0      0   7.2250        C
28          1       3  female  NaN      0      0   7.8792        Q
..        ...     ...     ...  ...    ...    ...      ...      ...
859         0       3    male  NaN      0      0   7.2292        C
863         0       3  female  NaN      8      2  69.5500        S
868         0       3    male  NaN      0      0   9.5000        S
878         0       3    male  NaN      0      0   7.8958        S
888         0       3  female  NaN      1      2  23.4500        S

[177 rows x 8 columns]

In [56]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [57]:
df['Age'].fillna(df['Age'].mean(),inplace = True)

df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [58]:
 df['Age'] = df['Age'].astype(int)

In [59]:
 df['Fare'] = df['Fare'].astype(int)

In [60]:
df.head()

   Survived  Pclass     Sex  Age  SibSp  Parch  Fare Embarked
0         0       3    male   22      1      0     7        S
1         1       1  female   38      1      0    71        C
2         1       3  female   26      0      0     7        S
3         1       1  female   35      1      0    53        S
4         0       3    male   35      0      0     8        S

In [61]:
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace = True)

In [62]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [63]:
df.head()

   Survived  Pclass     Sex  Age  SibSp  Parch  Fare Embarked
0         0       3    male   22      1      0     7        S
1         1       1  female   38      1      0    71        C
2         1       3  female   26      0      0     7        S
3         1       1  female   35      1      0    53        S
4         0       3    male   35      0      0     8        S

In [67]:
male_df = df[df['Sex']=='male']
female_df = df[df['Sex']=='female']

   Survived  Pclass   Sex  Age  SibSp  Parch  Fare Embarked
0         0       3  male   22      1      0     7        S
4         0       3  male   35      0      0     8        S
5         0       3  male   29      0      0     8        Q
6         0       1  male   54      0      0    51        S
7         0       3  male    2      3      1    21        S